export enum ISortVariant {
    NONE = 'Нет сортировки',
    QUESTION_ASK = 'По вопросу по возрастанию',
    QUESTION_DESK = 'По вопросу по убыванию',
    ANSWER_ASK = 'По ответу по возрастанию',
    ANSWER_DESK = 'По ответу по убыванию',
    NAME_ASK = 'По имени по возрастанию',
    NAME_DESK = 'По имени по убыванию',
    STATUS_ASK = 'По стсатусу сначала пройденные',
    STATUS_DESK = 'По статусу сначала не пройденные',
    DATE_ASK = 'По дате повторения сначала устаревшие',
    DATE_DESK = 'По дате повторения сначала новые'
}